import { useEffect, useState } from 'react';
import '../../styles/housing/housing-page.scss';

import heartIcon from '../../assets/icons/meta/heart-empty-grey.svg';
import shareIcon from '../../assets/icons/meta/share.svg';

import image1 from '../../assets/samples/housing/3.jpg';
import image2 from '../../assets/samples/housing/4.jpg';
import image3 from '../../assets/samples/housing/5.jpg';
import image4 from '../../assets/samples/housing/6.jpg';
import image5 from '../../assets/samples/housing/7.jpg';
import { processTranslations, Translation } from '../../helpers/TranslationService';
import { useTranslation } from 'react-i18next';
import ComponentsSection from './sections/ComponentsSection';
import DescriptionSection from './sections/DescriptionSection';
import BedroomsSection from './sections/BedroomsSection';
import FeaturesSection from './sections/FeaturesSection';

type Category = {
    id: string,
    nameKey: string,
    isCategoryPropertyRequired?: boolean,
    categoryPropertyDescriptionKey?: string,
    
    categoryTranslations: Translation[]
    categoryPropertyTranslations?: Translation[]
}

type Bedroom = {
    beds: Bed[]
}

type Feature = {
    nameCode: string,
    descriptionCode: string,
    featureIcon: string,
    typeCode: string,

    translations: Translation[]
}

export type Bed = {
    type: string,
    size: number
}

export interface Housing {
    id: string,
    name: string,
    country: string,
    place: string,
    category: Category,
    bathrooms: number,
    maxGuests: number,
    description: string;
    shortDescription: string,
    
    bedrooms: Bedroom[],
    images: string[],
    features: Feature[]
}

export default function HousingPage() {
    const { t } = useTranslation();

    const [housingData, setHousingData] = useState<Housing>({
        id: "1234",
        name: "Haus Hepi B&B біля озера Hallstatt 2",
        images: [
            image1,
            image2,
            image3,
            image4,
            image5
        ],
        country: "Австрія",
        place: "Obertraun",
        category: {
            id: "1234",
            nameKey: "category.room",
            categoryTranslations: [
                {
                    key: "category.room",
                    languageCode: "uk",
                    text: "Кімната"
                }
            ]
        },
        bathrooms: 2,
        bedrooms: [
            {
                beds: [
                    { 
                        type: "queen-size",
                        size: 2
                    },
                    { 
                        type: "queen-size",
                        size: 1
                    }
                ]
            },
            {
                beds: [
                    { 
                        type: "queen-size",
                        size: 1
                    }
                ]
            }
        ],
        maxGuests: 5,
        description: "Наш сімейний пансіонат ідеально розташований в ідилічному сільському містечку Обертраун в районі озер і гір Австрії, лише в декількох хвилинах ходьби від берегів озера Гальштат.Ми маємо чотири двомісні номери з сучасними ванними кімнатами та сонячними балконами з видом на гори, озеро та село. Ми надаємо туалетні принадлежности, фен і сейф у вашій кімнаті, і, звичайно, вся білизна та рушники включені. Крім того, ми маємо одну меншу двомісну кімнату з ванною кімнатою, яку можна використовувати для одномісного або двомісного проживання.Кожна спальня була традиційно мебльована, щоб відобразити наше альпійське оточення, і кожна з них має сучасну ванну кімнату з душем та туалетом.Сніданок входить до вартості вашого номера, ми пропонуємо обширний сніданок, який включає в себе вибір свіжозапечених рулетів, місцевого м 'яса, сирів, паштету та масла, домашніх консервів, круп, свіжих фруктів, яєць вільного діапазону та вибір гарячих та холодних напоїв. Наш просторий, сонячний зал для сніданку з панорамним видом на навколишній ліс, луги та гори. Показана ціна за номер за ніч з включенням сніданку.", 
        shortDescription: "Наш B&B розташований у спокійному місці, недалеко від лісу в Обертрауні, пропонує комфортний дім з домашньої атмосфери.  Зручно розташовані залізнична станція, берег озера та автобусна зупинка знаходяться всього в п 'яти хвилинах ходьби. Відкрийте для себе затишне село з багатьма пішохідними та велосипедними доріжками, що ведуть безпосередньо від дверей.  Порада: - Спитайте про вечерю!",

        features: [
            {
                nameCode: "features.hairdryer",
                descriptionCode: "",
                featureIcon: "M7 3.47608L6.81617 3.0111L6.5 3.1361V3.47608H7ZM17.5646 11.2074L17.5396 10.7081L17.5646 11.2074ZM22.5872 5.50579L23.0834 5.44433L22.5872 5.50579ZM17.1461 1.02592L17.1416 0.525943L17.1461 1.02592ZM14.2162 10.7513L14.0822 11.233L14.0923 11.2358L14.1025 11.2382L14.2162 10.7513ZM14.377 15.4683L14.8672 15.5663L14.8702 15.5514L14.8723 15.5362L14.377 15.4683ZM18.877 15.9683L19.362 16.0895L19.3676 16.0673L19.3711 16.0447L18.877 15.9683ZM1.6308 18.0375C1.39289 17.8973 1.08638 17.9765 0.946184 18.2144C0.805989 18.4523 0.8852 18.7588 1.12311 18.899L1.6308 18.0375ZM8.37695 12.9683L8.28384 13.4595L8.37695 12.9683ZM10.377 17.4683L10.862 17.5895L10.377 17.4683ZM12.877 20.9683L12.8444 21.4672L12.877 20.9683ZM6.5 9.47608C6.5 9.75222 6.72386 9.97608 7 9.97608C7.27614 9.97608 7.5 9.75222 7.5 9.47608H6.5ZM7.5 2.47608C7.5 2.19994 7.27614 1.97608 7 1.97608C6.72386 1.97608 6.5 2.19994 6.5 2.47608H7.5ZM10.877 5.47608C10.6008 5.47608 10.377 5.69994 10.377 5.97608C10.377 6.25222 10.6008 6.47608 10.877 6.47608V5.47608ZM12.877 6.47608C13.1531 6.47608 13.377 6.25222 13.377 5.97608C13.377 5.69994 13.1531 5.47608 12.877 5.47608V6.47608ZM6.5 3.47608V8.47608H7.5V3.47608H6.5ZM23.0834 5.44433C22.7155 2.47402 20.2191 0.498257 17.1416 0.525943L17.1506 1.5259C19.7809 1.50224 21.7928 3.15959 22.091 5.56724L23.0834 5.44433ZM17.1416 0.525943C15.0465 0.544791 12.4529 1.17556 10.4145 1.78563C9.38857 2.09267 8.49066 2.39842 7.84904 2.62746C7.52809 2.74203 7.2709 2.83753 7.09349 2.90458C7.00477 2.9381 6.93597 2.96452 6.88909 2.98267C6.86565 2.99174 6.84769 2.99874 6.83545 3.00353C6.82934 3.00592 6.82465 3.00776 6.82143 3.00903C6.81981 3.00966 6.81857 3.01016 6.81769 3.0105C6.81725 3.01067 6.81691 3.01081 6.81665 3.01091C6.81653 3.01096 6.81641 3.01101 6.81634 3.01103C6.81625 3.01107 6.81617 3.0111 7 3.47608C7.18383 3.94106 7.1838 3.94107 7.1838 3.94107C7.18383 3.94106 7.18385 3.94106 7.18391 3.94103C7.18402 3.94098 7.18423 3.9409 7.18454 3.94078C7.18514 3.94054 7.18612 3.94016 7.18746 3.93963C7.19013 3.93858 7.19426 3.93696 7.19982 3.93478C7.21094 3.93043 7.22775 3.92388 7.25002 3.91526C7.29455 3.89803 7.36087 3.87256 7.44699 3.84001C7.61926 3.77491 7.87064 3.68155 8.18523 3.56925C8.81467 3.34456 9.69568 3.04459 10.7012 2.74364C12.7258 2.13771 15.2052 1.5434 17.1506 1.5259L17.1416 0.525943ZM7 8.47608C6.83872 8.94935 6.83874 8.94936 6.83878 8.94938C6.83882 8.94939 6.83888 8.94941 6.83895 8.94943C6.83909 8.94948 6.8393 8.94955 6.83957 8.94965C6.84012 8.94983 6.84092 8.9501 6.84198 8.95047C6.8441 8.95119 6.84724 8.95226 6.85139 8.95367C6.85969 8.95649 6.87201 8.96068 6.88816 8.96616C6.92048 8.97713 6.96817 8.99329 7.02986 9.01413C7.15323 9.05581 7.33261 9.11622 7.55697 9.19124C8.00564 9.34126 8.63439 9.54976 9.35495 9.78379C10.7943 10.2513 12.6066 10.8228 14.0822 11.233L14.3501 10.2696C12.8959 9.86529 11.1001 9.29919 9.66386 8.8327C8.9466 8.59974 8.32065 8.39217 7.87407 8.24285C7.6508 8.1682 7.47242 8.10812 7.34994 8.06674C7.2887 8.04605 7.24145 8.03004 7.20954 8.01921C7.19359 8.01379 7.18148 8.00968 7.17338 8.00692C7.16933 8.00555 7.16628 8.00451 7.16426 8.00382C7.16325 8.00348 7.16249 8.00322 7.16199 8.00305C7.16175 8.00296 7.16156 8.0029 7.16144 8.00286C7.16138 8.00284 7.16134 8.00283 7.16131 8.00282C7.16129 8.00281 7.16128 8.00281 7 8.47608ZM20.0113 5.91964C20.0113 6.98024 19.1238 7.8632 18 7.8632V8.8632C19.6501 8.8632 21.0113 7.55813 21.0113 5.91964H20.0113ZM18 7.8632C16.8762 7.8632 15.9887 6.98025 15.9887 5.91964H14.9887C14.9887 7.55812 16.3499 8.8632 18 8.8632V7.8632ZM15.9887 5.91964C15.9887 4.85904 16.8762 3.97608 18 3.97608V2.97608C16.3499 2.97608 14.9887 4.28117 14.9887 5.91964H15.9887ZM18 3.97608C19.1238 3.97608 20.0113 4.85904 20.0113 5.91964H21.0113C21.0113 4.28116 19.6501 2.97608 18 2.97608V3.97608ZM13.8867 15.3702C13.7435 16.0859 14.1234 16.7489 14.5851 17.1892C15.0531 17.6353 15.7188 17.9683 16.377 17.9683V16.9683C16.0351 16.9683 15.6051 16.7799 15.2752 16.4654C14.9391 16.145 14.8189 15.808 14.8672 15.5663L13.8867 15.3702ZM16.377 17.9683C16.9484 17.9683 17.5916 17.8328 18.14 17.5428C18.6894 17.2524 19.1896 16.7794 19.362 16.0895L18.3919 15.847C18.3093 16.1773 18.0594 16.4543 17.6726 16.6588C17.2848 16.8638 16.8055 16.9683 16.377 16.9683V17.9683ZM1.12311 18.899C2.00273 19.4174 3.07623 19.2538 3.88363 18.7924C4.69102 18.3311 5.37695 17.4893 5.37695 16.4683H4.37695C4.37695 17.0215 3.99102 17.5793 3.38749 17.9242C2.78396 18.2691 2.10746 18.3184 1.6308 18.0375L1.12311 18.899ZM5.37695 16.4683C5.37695 15.5964 5.72796 14.7549 6.27696 14.178C6.82166 13.6056 7.53277 13.3172 8.28384 13.4595L8.47007 12.477C7.32195 12.2594 6.28306 12.721 5.55256 13.4886C4.82635 14.2517 4.37695 15.3402 4.37695 16.4683H5.37695ZM8.28384 13.4595C9.01813 13.5987 9.51686 14.1044 9.79307 14.8307C10.0736 15.5684 10.1041 16.498 9.89188 17.347L10.862 17.5895C11.1162 16.5728 11.0914 15.4315 10.7278 14.4752C10.3597 13.5074 9.62524 12.696 8.47007 12.477L8.28384 13.4595ZM9.89188 17.347C9.61551 18.4525 9.75266 19.4577 10.3047 20.2151C10.8563 20.972 11.7604 21.3965 12.8444 21.4672L12.9095 20.4693C12.0451 20.413 11.4491 20.0875 11.1128 19.6261C10.777 19.1653 10.6384 18.4841 10.862 17.5895L9.89188 17.347ZM12.8444 21.4672C15.0746 21.6127 17.0213 19.6659 16.8759 17.4357L15.878 17.5008C15.9842 19.1284 14.5371 20.5755 12.9095 20.4693L12.8444 21.4672ZM17.5896 11.7068C18.4249 11.665 19.2153 11.4478 19.9229 11.0952L19.4768 10.2002C18.8888 10.4932 18.2328 10.6734 17.5396 10.7081L17.5896 11.7068ZM19.9229 11.0952C21.9927 10.0636 23.3816 7.852 23.0834 5.44433L22.091 5.56724C22.3309 7.5042 21.2142 9.33431 19.4768 10.2002L19.9229 11.0952ZM19.3711 16.0447L20.194 10.7241L19.2057 10.5712L18.3828 15.8918L19.3711 16.0447ZM14.1025 11.2382C14.3088 11.2864 14.5839 11.3513 14.8972 11.4171L15.1028 10.4384C14.8024 10.3754 14.5384 10.3131 14.3299 10.2644L14.1025 11.2382ZM14.8972 11.4171C15.6564 11.5765 16.6866 11.752 17.5896 11.7068L17.5396 10.7081C16.773 10.7464 15.8491 10.5952 15.1028 10.4384L14.8972 11.4171ZM14.8723 15.5362L15.4954 10.9957L14.5046 10.8598L13.8816 15.4003L14.8723 15.5362ZM6.5 8.47608V9.47608H7.5V8.47608H6.5ZM7.5 9.47608V2.47608H6.5V9.47608H7.5ZM10.877 6.47608H12.877V5.47608H10.877V6.47608Z",
                typeCode: "features.types.bathroom",
                translations: [
                    {
                        key: "features.hairdryer",
                        languageCode: "uk",
                        text: "Фен"
                    },
                    {
                        key: "features.type.bathroom",
                        languageCode: "uk",
                        text: "Ванна кімната"
                    },
                    {
                        key: "features.hairdryer",
                        languageCode: "en",
                        text: "Hair dryer"
                    },
                    {
                        key: "features.type.bathroom",
                        languageCode: "en",
                        text: "Bathroom"
                    },
                ]
            }
        ]
    });

    useEffect(() => {
        processTranslations(housingData.category.categoryTranslations);
        housingData.features.forEach(feature => {
            processTranslations(feature.translations);
        });
    }, [housingData]);

    return (
        <>
            <div className="housing-page">
                <div className='housing-page-content'>
                    <section className='header-section'>
                        <h1 className='housing-name'>
                            {housingData.name}
                        </h1>
                        <div className='housing-actions'>
                            <img src={shareIcon} />
                            <img src={heartIcon} />
                        </div>
                    </section>
                    <section className='housing-images-section'>
                        <div className='big-picture-container'>
                            <div className='big-picture-wrapper'>
                                <img src={housingData.images[0]} />
                            </div>   
                        </div>
                        <div className='small-pictures-container'>
                            {housingData.images.slice(1, housingData.images.length > 4 ? 5 : housingData.images.length - 1).map((image, index) => (    
                                <div className='small-picture-wrapper' key={index}>
                                    <img src={image} key={index} />
                                </div>                            
                                
                            ))}
                        </div>
                    </section>
                    <div className='main-section'>
                        <div className='data-section'>
                            <section className='location-section'>
                                {`${housingData.place}, ${housingData.country}: ${t(housingData.category.nameKey)}`}
                            </section>
                            <ComponentsSection housingData={housingData} />
                            <DescriptionSection housingData={housingData} />
                            <hr className='divider' />
                            <BedroomsSection housingData={housingData} />
                            <hr className='divider' />
                            <FeaturesSection housingData={housingData} />
                        </div>
                        <div className='rent-section'>

                        </div>
                    </div>
                </div>
            </div>
        </>
    );
}